Repository: 54maxwu/flutter-eg990-mobile
Catalog: lib/l10n/intl_*.arb
Languages: th, vi, zh

# textUpdateMessage
source: If a new version is found, please click the "Update" button to download and install. Current version number: {version} New version number: {value}
th: หากพบเวอร์ชันใหม่โปรดคลิกปุ่ม “อัปเดต” เพื่อดาวน์โหลดและติดตั้ง. หมายเลขเวอร์ชันปัจจุบัน: {version} หมายเลขเวอร์ชันใหม่: {value}
vi: Nếu tìm thấy phiên bản mới, vui lòng nhấp vào nút "Cập nhật" để tải xuống và cài đặt. Số phiên bản hiện tại: {version} Số phiên bản mới: {value}
zh: 发现新版本，请点击“更新”按钮前往下载安装。 当前版本号：{version} 新版本号：{value}

# walletBtnHintOneClickTransfer
source: All platform credits are transferred to the main wallet
th: โควต้าของแพลตฟอร์มทั้งหมดจะถูกโอนไปยังกระเป๋าเงินหลัก
vi: Tất cả các khoản tín dụng của nền tảng được chuyển vào ví chính
zh: 所有平台额度转入主钱包

# walletBtnOneClickTransfer
source: One-click transfer all
th: คลิกเดียวสู่บัญชี
vi: Trang chủ một cú nhấp chuột
zh: 一键归户

# walletHintWalletMulti
source: *Need to manually transfer the quota to the game platform
th: * คุณต้องโอนเงินไปยังแพลตฟอร์มเกมด้วยตนเอง
vi: * Cần chuyển hạn ngạch theo cách thủ công sang nền tảng trò chơi
zh: *需手动转移额度到该游戏平台

# walletHintWalletSingle
source: *By default, the credit will be automatically transferred to the open game platform
th: * ค่าเริ่มต้นระบบจะโอนเครดิตไปยังแพลตฟอร์มเกมที่เปิดโดยอัตโนมัติ
vi: * Theo mặc định, tín dụng sẽ được tự động chuyển sang nền tảng trò chơi mở
zh: *系统预设，自动将额度转入开启的游戏平台

# walletHintWalletType
source: *When the setting is turned on, the wallet limit will be automatically transferred to the opened game platform (Each change needs to wait 30 seconds for the setting to take effect)
th: * เมื่อเปิดการตั้งค่าขีด จำกัด กระเป๋าเงินจะถูกโอนไปยังแพลตฟอร์มเกมที่เปิดโดยอัตโนมัติ (การเปลี่ยนแปลงแต่ละครั้งต้องรอ 30 วินาทีเพื่อให้การตั้งค่ามีผล)
vi: * Khi cài đặt được bật, giới hạn ví sẽ tự động được chuyển sang nền tảng trò chơi đã mở (Mỗi thay đổi cần đợi 30 giây để cài đặt có hiệu lực)
zh: *设置开启时，自动将钱包额度转入开启的游戏平台 (每次更改需等侯30秒让设置生效)

# walletOptionMulti
source: Multi wallet
th: กระเป๋าเงินหลายใบ
vi: Nhiều ví
zh: 多钱包

# walletOptionSingle
source: Single wallet
th: กระเป๋าเงินใบเดียว
vi: Ví đơn
zh: 单一钱包

# walletTextChangeType
source: Change wallet settings
th: เปลี่ยนการตั้งค่า กระเป๋าสตางค์
vi: Thay đổi cài đặt ví
zh: 更改钱包设置

# walletTextWaitTransfer
source: Returning, please wait...
th: กำลังคืนบัญชีโปรดรอ ...
vi: Đang quay lại, vui lòng đợi ...
zh: 归户中，请稍候...

# walletTitleCenter
source: Central Wallet
th: กระเป๋าเงินกลาง
vi: Ví trung tâm
zh: 中心钱包

# walletTitleMy
source: My
th: กระเป๋าเงินของฉัน
vi: Túi của tôi
zh: 我的钱包

# withdrawHintChangeCard
source: If you want to change the membership of the bank card bound to the network during withdrawal, please contact the online customer service for instructions.
th: สมาชิกที่ต้องการเปลี่ยนบัตรธนาคารที่ผูกไว้กับเครือข่ายเมื่อถอนเงินโปรดติดต่อฝ่ายบริการลูกค้าออนไลน์เพื่อขอคำแนะนำ
vi: Nếu bạn muốn thay đổi thành viên của thẻ ngân hàng liên kết với mạng trong quá trình rút tiền, vui lòng liên hệ với bộ phận chăm sóc khách hàng trực tuyến để được hướng dẫn.
zh: 提款时想要更改与网络绑定的银行卡的会员，请联系在线客服以获取指示。

# withdrawHintFee
source: Each member account can only withdraw up to 3 withdrawals per day, if more than 3 withdrawals will be added 5% service charge.
th: บัญชีสมาชิกแต่ละบัญชีสามารถถอนได้สูงสุด 3 ครั้งต่อวันหากถอนมากกว่า 3 ครั้งจะถูกเรียกเก็บค่าบริการ 5%
vi: Mỗi tài khoản thành viên chỉ được rút tối đa 3 lần rút trong ngày, nếu rút nhiều hơn 3 lần sẽ được cộng thêm 5% phí dịch vụ.
zh: 每个会员账户每天最多只能取3次提款，如果超过3次将加收5％的服务费。

# certificateTitleMGA
source: Malta Gaming License (MGA) Certification
vi: Chứng nhận Giấy phép Trò chơi Malta (MGA)
zh: 马耳他博彩牌照（MGA）认证

# errorTaskFailed
source: {msg} failed
vi: {msg} không thành công
zh: {msg}失败

# fieldOptionGender
source: {sex, select, male{Male} female{Female} other{Other}}
vi: {sex, select, male{Nam} female{Nữ} other{Khác}}
zh: {sex, select, male{男} female{女} other{其他}}

# fieldTitleSkype
source: Skype
vi: Ứng dụng trò chuyện
