Repository: 54maxwu/flutter-eg990-mobile
Catalog: lib/l10n/intl_*.arb
Languages: th, vi, zh

# appExitHint
source: Press again to close the app {cnt}
th: กด {cnt} อีกครั้งเพื่อปิดแอป
vi: Nhấn lại {cnt} để đóng ứng dụng
zh: 再按{cnt}次关闭APP

# appThemeColorDark
source: Dark
th: มืด
vi: Tối
zh: 深色

# appThemeColorDefault
source: Default
th: ค่าที่ตั้งล่วงหน้า
vi: Đặt trước
zh: 预设

# appThemeColorHintSelect
source: Choose theme color
th: เลือกสีของธีม
vi: Chọn màu chủ đề
zh: 选择主题颜色

# appThemeColorLight
source: Light
th: สีอ่อน
vi: Màu sáng
zh: 浅色

# appVersion
source: Version {value}
th: หมายเลขเวอร์ชัน {value}
vi: Số phiên bản {value}
zh: 版本号 {value}

# btnBack
source: Back
th: ย้อนกลับ
vi: trở về
zh: 返回

# btnBind
source: Bind
th: ผูก
vi: Trói buộc
zh: 绑定

# btnCancel
source: Cancel
th: ยกเลิก
vi: hủy bỏ
zh: 取消

# btnClickImageToRefresh
source: Tap Image to refresh
th: การรีเฟรชภาพจุด
vi: Làm mới biểu đồ điểm
zh: 点图刷新

# btnClickToBind
source: Click me to bind
th: คลิกเพื่อผูก
vi: Nhấp vào tôi để ràng buộc
zh: 点我绑定

# btnClickToDownload
source: Click me to download
th: คลิกฉันเพื่อดาวน์โหลด
vi: Nhấp vào tôi để tải xuống
zh: 点我下载

# btnClose
source: Close
th: ปิด
vi: tắt
zh: 关闭

# btnConfirm
source: Confirm
th: ยืนยัน
vi: mục đích
zh: 确定

# btnConfirmSend
source: Confirm and send
th: ยืนยันที่จะส่ง
vi: Xác nhận gửi
zh: 确定送出

# btnConfirmTransfer
source: Confirm transfer
th: ยืนยันการโอน
vi: Xác nhận chuyển khoản
zh: 确认转帐

# btnCopy
source: Copy
th: คัดลอก
vi: sao chép
zh: 复制

# btnDownload
source: Download
th: ดาวน์โหลด
vi: Tải xuống
zh: 下载

# btnEdit
source: Edit
th: แก้ไข
vi: sửa đổi
zh: 修改

# btnForwardTo
source: Go to
th: ไปที่
vi: Đi đến
zh: 前往

# btnNextStep
source: Next step
th: ขั้นตอนต่อไป
vi: Bước tiếp theo
zh: 下一步

# btnOpen
source: Open
th: เปิด
vi: Bật
zh: 开启

# btnPreStep
source: Previous
th: ขั้นตอนก่อนหน้า
vi: Trước
zh: 上一步

# btnQuery
source: Inquire
th: แบบสอบถาม
vi: Hỏi thăm
zh: 查询

# btnQueryNow
source: Enquire now
th: ค้นหาทันที
vi: Hỏi thăm ngay
zh: 立即查询

# btnRefresh
source: Refresh
th: รีเฟรช
vi: Làm tươi
zh: 刷新

# btnResetPassword
source: Forget password
th: ลืมรหัสผ่าน
vi: quên mật khẩu
zh: 忘记密码

# btnSearch
source: Search
th: ค้นหา
vi: Tìm kiếm
zh: 搜寻

# btnSend
source: Send
th: ส่ง
vi: gửi
zh: 发送

# btnSendOut
source: Send
th: ส่งออก
vi: Gửi đi
zh: 送出

# btnShow
source: Show
th: แสดง
vi: trưng bày
zh: 显示

# btnSignUp
source: Sign in now
th: ลงชื่อเข้าใช้ทันที
vi: Đăng nhập ngay
zh: 立即签到

# btnSubmit
source: Submit
th: ส่ง
vi: Gửi đi
zh: 提交

# btnSwitchOff
source: Off
th: ปิด
vi: tắt
zh: 关

# btnSwitchOn
source: On
th: เปิด
vi: mở
zh: 开

# btnTransferIn
source: Transfer to
th: โอนเข้า
vi: Chuyển giao
zh: 转入

# btnTransferOut
source: Transfer from
th: โอนออก
vi: Chuyển ra ngoài
zh: 转出

# btnUpdate
source: Update
th: อัปเดต
vi: Cập nhật
zh: 更新

# centerHintEMail
source: Bind email to protect account security
th: ผูกอีเมลเพื่อป้องกันความปลอดภัยของบัญชี
vi: Liên kết email để bảo vệ bảo mật tài khoản
zh: 绑定电子邮箱保护帐号安全

# centerHintMemberName
source: The name must be the same as the name of the bank card holder, otherwise the withdrawal will not be possible
th: ชื่อต้องตรงกับชื่อของผู้ถือบัตรธนาคารมิฉะนั้นจะถอนเงินไม่ได้
vi: Tên phải trùng với tên của chủ thẻ ngân hàng, nếu không sẽ không rút được tiền
zh: 姓名需与银行卡持卡人姓名一致，否则无法提款

# centerHintNoName
source: Please go to bind the bank card to make relevant settings
th: โปรดไปผูกบัตรธนาคารเพื่อทำการตั้งค่าที่เกี่ยวข้อง
vi: Vui lòng đi đến liên kết thẻ ngân hàng để thực hiện các cài đặt liên quan
zh: 请至绑订银行卡做相关设定

# centerHintPrivacyEdit
source: For your privacy, the information cannot be modified after confirmation If you need assistance, please contact customer service
th: เพื่อความเป็นส่วนตัวของคุณข้อมูลจะไม่สามารถแก้ไขได้หลังจากยืนยันแล้ว หากคุณต้องการความช่วยเหลือโปรดติดต่อฝ่ายบริการลูกค้า
vi: Vì quyền riêng tư của bạn, không thể sửa đổi thông tin sau khi xác nhận.
zh: 为了您的隐私安全，信息在确认後将无法修改

# centerTabMemberData
source: personal information
th: ข้อมูลส่วนบุคคล
vi: thông tin cá nhân
zh: 个人资料

# centerTabVipRank
source: VIP class
th: อันดับ Vip
vi: Hạng VIP
zh: Vip阶层

# centerTextHeadPhoto
source: Profile
th: รูปถ่ายส่วนตัว
vi: Ảnh đại diện
zh: 个人头像

# certificateTitle
source: License
th: ใบอนุญาต
vi: giấy phép
zh: 牌照

# certificateTitleBVI
source: British Virgin Islands (BVI) certification
th: การรับรองหมู่เกาะบริติชเวอร์จิน (BVI)
vi: Chứng nhận Quần đảo Virgin thuộc Anh (BVI)
zh: 英属维尔京群岛（BVI）认证

# certificateTitleGC
source: British GC Oversight Committee
th: UK GC Oversight Committee
vi: Ủy ban giám sát GC của Anh
zh: 英国GC监督委员会

# certificateTitlePGC
source: The Philippines (PAGCOR) Supervises Gaming Cards
th: ฟิลิปปินส์ (PAGCOR) การ์ดเกมภายใต้การดูแล
vi: Philippines (PAGCOR) Giám sát thẻ chơi game
zh: 菲律宾（PAGCOR）监督博彩牌

# dealsDetailTypeAdjustDeposit
source: Adjust deposit
th: ปรับเงินฝาก
vi: Tiền gửi điều chỉnh
zh: 调整存款

# dealsDetailTypeAdjustWithdraw
source: Adjust withdrawal
th: ปรับการถอน
vi: Điều chỉnh việc rút tiền
zh: 调整取款

# depositHintGetInfoFromCs
source: Please contact customer service for deposit target account information
th: โปรดติดต่อฝ่ายบริการลูกค้าสำหรับข้อมูลบัญชีเติมเงิน
vi: Vui lòng liên hệ bộ phận chăm sóc khách hàng để biết thông tin tài khoản nạp tiền
zh: 充值帐号资讯请联络客服

# depositHintNoBankcard
source: please fill in the bank card information first
th: โปรดเพิ่มบัตรธนาคารก่อน
vi: Vui lòng điền thông tin thẻ ngân hàng trước
zh: 充值请先填写银行卡资讯

# depositHintOrderMaxAmount
source: Single maximum limit: {value}
th: ขีดจำกัดการฝากเงินครั้งเดียว: {value}
vi: Giới hạn tối đa duy nhất: {value}
zh: 单笔最高限额: {value}

# depositPaymentNoData
source: Check that there is no recharge method available
th: ตรวจสอบว่าไม่มีวิธีการเติมเงิน
vi: Kiểm tra xem không có phương thức nạp tiền nào khả dụng
zh: 查無可使用的充值方式

# depositPaymentTitleAli
source: Ali Pay
th: Ali จ่าย
vi: Thanh toán bằng Ali-Pay
zh: 支付宝支付

# depositPaymentTitleAtm
source: Online Transfer
th: โอนเงินทางธนาคารออนไลน์
vi: Chuyển khoản Ngân hàng Trực tuyến
zh: 网银转帐

# depositPaymentTitleBank
source: Bank Deposit
th: เงินฝากธนาคาร
vi: Nạp tiền ngân hàng
zh: 银行充值

# depositPaymentTitleCgp
source: CG Pay
th: CG จ่าย
vi: Ví Gobao
zh: 购宝钱包

# depositPaymentTitleJd
source: JD Pay
th: JD จ่าย
zh: 京东支付

# depositPaymentTitleOnline
source: Online Payment
th: การชำระเงินออนไลน์
vi: Thanh toán trực tuyến
zh: 在线支付

# depositPaymentTitleQr
source: QR Pay
th: รหัสสแกน QR
vi: Mã quét QR
zh: QR扫码

# depositPaymentTitleQuick
source: Quick Pay(Recommend)
th: เร็ว จ่าย (แนะนำ)
vi: Thanh toán nhanh chóng (khuyến nghị)
zh: 快捷支付(推荐)

# depositPaymentTitleUnion
source: Union Pay
th: ยูเนี่ยนเพย์ จ่าย
vi: Thanh toán UnionPay
zh: 银联支付

# depositPaymentTitleWechat
source: WeChat Pay
th: WeChat จ่าย
vi: Thanh toán qua WeChat
zh: 微信支付

# dialogTextTransferActionTo
source: Confirm {action} {platform} platform?
th: คุณแน่ใจหรือว่าแพลตฟอร์ม {action} {platform}
vi: Bạn có muốn xác nhận nền tảng {action} {platform} không?
zh: 是否确认{action} {platform} 平台？

# dialogTitleConfirmInfo
source: Confirm information
th: ข้อมูลการยืนยัน
vi: Xác nhận thông tin
zh: 确认信息

# errorAccount
source: Account error
th: ข้อผิดพลาดของบัญชี
vi: Lỗi tài khoản
zh: 帐号错误

# errorAccountLocked
source: The account is locked, please contact customer service
th: บัญชีถูกล็อกโปรดติดต่อฝ่ายบริการลูกค้า
vi: Tài khoản bị khóa, vui lòng liên hệ với bộ phận chăm sóc khách hàng
zh: 帐号已锁定，请联系客服

# errorActionFailed
source: Invalid operation
th: การดำเนินการไม่ถูกต้อง
vi: Hoạt động không hợp lệ
zh: 操作无效

# errorActionTooFrequent
source: Request too frequent
th: คำขอบ่อยเกินไป
vi: Yêu cầu quá thường xuyên
zh: 请求过于频繁

# errorCachedFile
source: Cached data error, please try again later or contact customer service
th: ข้อผิดพลาดข้อมูลแคชโปรดลองอีกครั้งในภายหลังหรือติดต่อฝ่ายบริการลูกค้า
vi: Lỗi dữ liệu đã lưu trong bộ nhớ cache, vui lòng thử lại sau hoặc liên hệ với dịch vụ khách hàng
zh: 缓存数据错误，请稍候再重试或联系客服

# errorDeposit
source: Recharge failed, please try again later or contact customer service
th: การเติมเงินล้มเหลวโปรดลองอีกครั้งในภายหลังหรือติดต่อฝ่ายบริการลูกค้า
vi: Nạp tiền không thành công, vui lòng thử lại sau hoặc liên hệ với dịch vụ khách hàng
zh: 充值失败，请稍候重试或联系客服

# errorEvent
source: Unable to get the sign-in activity data, please try again later or contact customer service
th: ไม่สามารถรับข้อมูลเหตุการณ์การลงชื่อเข้าใช้โปรดลองอีกครั้งในภายหลังหรือติดต่อฝ่ายบริการลูกค้า
vi: Không thể lấy dữ liệu hoạt động đăng nhập, vui lòng thử lại sau hoặc liên hệ với dịch vụ khách hàng
zh: 无法取得签到活动数据，请稍候再重试或联系客服

# errorGameAccessPermission
source: Game access denied, please contact customer service
th: ไม่มีสิทธิ์เล่นโปรดติดต่อฝ่ายบริการลูกค้า
vi: Không có quyền chơi, vui lòng liên hệ với dịch vụ khách hàng
zh: 没有游玩权限，请联系客服

# errorHaveBoundCard
source: Bank card has been bound
th: ผูกบัตรธนาคารแล้ว
vi: Thẻ ngân hàng đã bị ràng buộc
zh: 已绑定过银行卡

# errorInternal
source: Internal error, please try again later or contact customer service
th: ข้อผิดพลาดภายในโปรดลองอีกครั้งในภายหลังหรือติดต่อฝ่ายบริการลูกค้า
vi: Lỗi nội bộ, vui lòng thử lại sau hoặc liên hệ với dịch vụ khách hàng
zh: 内部错误，请稍候再重试或联系客服

# errorInvalidAmountBelowLimit
source: Below the minimum withdrawal amount
th: ต่ำกว่าจำนวนเงินขั้นต่ำในการถอน
vi: Dưới số tiền rút tối thiểu
zh: 低于最低提款金额

# errorInvalidAmountExceedRemain
source: Exceed account balance
th: เกินยอดเงินในบัญชี
vi: Vượt quá số dư tài khoản
zh: 超过帐户余额

# errorInvalidDepositAmountMaxLimit
source: The recharge amount exceeds the upper limit
th: จำนวนเงินฝากเกินขีด จำกัด สูงสุด
vi: Số tiền nạp vượt quá giới hạn trên
zh: 充值金额超过上限

# errorInvalidDepositAmountMinLimit
source: The recharge amount is below the lower limit
th: จำนวนเงินฝากต่ำกว่าขีด จำกัด ล่าง
vi: Số tiền nạp dưới giới hạn thấp hơn
zh: 充值金额低于下限

# errorInvalidExceedOrderAmount
source: Exceeds the single maximum withdrawal amount (please refer to the membership level system)
th: เกินจำนวนถอนสูงสุดเพียงครั้งเดียว (โปรดดูที่ระบบระดับสมาชิก)
vi: Vượt quá số tiền rút tối đa duy nhất (vui lòng tham khảo hệ thống cấp độ thành viên)
zh: 超过单笔最大提现金额(请参考会员等级制度)

# errorInvalidMobile
source: Wrong phone number
th: หมายเลขโทรศัพท์มือถือผิดพลาด
vi: Số điện thoại sai
zh: 手机号码错误

# errorInvalidPassword
source: Wrong password
th: รหัสผ่านผิดพลาด
vi: sai mật khẩu
zh: 密码错误

# errorInvalidPasswordFive
source: The password does not match, the account will be locked for five errors
th: รหัสผ่านไม่ตรงกันบัญชีจะถูกล็อกหลังจากเกิดข้อผิดพลาด 5 ข้อ
vi: Mật khẩu không khớp, tài khoản sẽ bị khóa vì năm lỗi
zh: 密码不符合，错误五次将锁定帐号

# errorInvalidReferral
source: Invalid referral code
th: รหัสอ้างอิงไม่ถูกต้อง
vi: Mã giới thiệu không hợp lệ
zh: 推荐码无效

# errorInvalidWithdrawPassword
source: The password does not match (the default value is the login password)
th: รหัสผ่านไม่ตรงกัน (ค่าเริ่มต้นคือรหัสผ่านสำหรับเข้าสู่ระบบ)
vi: Mật khẩu không khớp (giá trị mặc định là mật khẩu đăng nhập)
zh: 密码不符合(默认值为登录密码)

# errorLoadingGame
source: There was an error loading the game, please try again later
th: เกิดข้อผิดพลาดขณะโหลดเกมโปรดลองอีกครั้งในภายหลัง
vi: Đã xảy ra lỗi khi tải trò chơi, vui lòng thử lại sau
zh: 游戏加载发生错误，请稍候再重试

# errorLoadingPayUrl
source: Page loading error, please try again later
th: ข้อผิดพลาดในการโหลดหน้าเว็บโปรดลองอีกครั้งในภายหลัง
vi: Lỗi tải trang, vui lòng thử lại sau
zh: 网页加载错误，请稍候再重试

# errorLoginFailed
source: Login failed
th: เข้าสู่ระบบล้มเหลว
vi: Đăng nhập thất bại
zh: 登入失败

# errorMobileAlreadyRegistered
source: Duplicate phone number registration
th: การลงทะเบียนหมายเลขโทรศัพท์มือถือซ้ำ
vi: Đăng ký số điện thoại trùng lặp
zh: 手机号码重复注册

# errorNoServerConnection
source: Unable to connect to the server!!
th: ไม่สามารถเชื่อมต่อกับเซิร์ฟเวอร์ !!
vi: Không thể kết nối đến máy chủ!!
zh: 无法连接至伺服器!!

# errorPlatformTransferNotAvailable
source: The selected platform is currently unable to transfer funds
th: ขณะนี้แพลตฟอร์มที่เลือกไม่สามารถโอนเงินได้
vi: Nền tảng đã chọn hiện không thể chuyển tiền
zh: 所选平台当前无法转帐

# errorRegisterFailed
source: Registration failed
th: การลงทะเบียนล้มเหลว
vi: đăng ký thất bại
zh: 注册失败

# errorRegisterRepeatAccount
source: Duplicate account registration
th: การลงทะเบียนบัญชีซ้ำ
vi: Đăng ký tài khoản trùng lặp
zh: 帐号重复注册

# errorServerData
source: Server data error, please try again later or contact customer service
th: ข้อผิดพลาดของข้อมูลเซิร์ฟเวอร์โปรดลองอีกครั้งในภายหลังหรือติดต่อฝ่ายบริการลูกค้า
vi: Lỗi dữ liệu máy chủ, vui lòng thử lại sau hoặc liên hệ với dịch vụ khách hàng
zh: 伺服器資料错误，请稍候再重试或联系客服

# errorStatus
source: Error: {msg}
th: ข้อผิดพลาด: {msg}
vi: Lỗi: {msg}
zh: 错误:{msg}

# errorStatusCause
source: Error: (msg) ((msg2))
th: ข้อผิดพลาด: {msg} ({msg2})
vi: Lỗi: (msg) ((msg2))
zh: 错误:{msg}({msg2})

# errorTimeoutError
source: The network timed out, please try again later
th: เครือข่ายหมดเวลาโปรดลองอีกครั้งในภายหลัง
vi: Mạng đã hết thời gian chờ, vui lòng thử lại sau
zh: 网络逾時，请稍候再重试

# errorToken
source: User verification failed, please log in again or contact customer service
th: การตรวจสอบผู้ใช้ล้มเหลวโปรดเข้าสู่ระบบอีกครั้งหรือติดต่อฝ่ายบริการลูกค้า
vi: Xác minh người dùng không thành công, vui lòng đăng nhập lại hoặc liên hệ với dịch vụ khách hàng
zh: 用户验证失败，请重新登入或联系客服

# errorTransfer
source: Transfer failed
th: การโอนล้มเหลว
vi: Chuyển không thành công
zh: 转帐失败

# errorWithdraw
source: Withdrawal failed
th: การถอนล้มเหลว
vi: Rút tiền không thành công
zh: 提款失败

# fieldActionChangePassword
source: Change Password
th: เปลี่ยนรหัสผ่าน
vi: đổi mật khẩu
zh: 修改密码

# fieldActionGetVerifyCode
source: Get Verification Code
th: รับรหัสยืนยัน
vi: lấy mã xác minh
zh: 获取验证码

# fieldCheckBoxPromoNews
source: Receive promotion information
th: รับข้อมูลโปรโมชั่น
vi: Nhận thông tin khuyến mãi
zh: 接收优惠活动信息

# fieldCheckBoxSaveLogin
source: Remember login info
th: จำรหัสผ่านบัญชี
vi: Nhớ bí mật tài khoản
zh: 记住帐密

# fieldCheckBoxStopShowing
source: Do not show again
th: ไม่ต้องแสดงอีก
vi: không hiển thị trở lại
zh: 不再显示

# fieldCheckBoxTerms
source: Have read and agree to the betting rules of the "Terms and Conditions"
th: ได้อ่านและยอมรับกฎการเดิมพันของ
vi: Đã đọc và đồng ý với các quy tắc cá cược của "Điều khoản và Điều kiện"
zh: 已阅读并同意《条款与细则》的投注规则

# fieldChipAmountAll
source: Max
th: เต็มจำนวน
vi: Hạn ngạch đầy đủ
zh: 全部额度

# fieldErrorCardAccountName
source: Incorrect account name
th: ข้อผิดพลาดของชื่อบัญชี

# fieldErrorCardNumber
source: The card number is {min}~{max} characters
th: หมายเลขบัตรคือ {min} ~ {max} characters
vi: Số thẻ là {min} ~ {max} ký tự
zh: 卡号为{min}~{max}个字

# fieldErrorCardNumberFixed
source: The card number is {min}~{max} characters (beginning with {fixed})
th: หมายเลขบัตรคือ {min} ~ {max} ตัวอักษร (ขึ้นต้นด้วย {fixed})
vi: Số thẻ là {min} ~ {max} ký tự (bắt đầu bằng {fixed})
zh: 卡号为{min}~{max}个字(开头为{fixed})

# fieldErrorCardOwner
source: Cardholder name is wrong
th: ชื่อผู้ถือบัตรไม่ถูกต้อง
vi: Tên chủ thẻ sai
zh: 持卡人名称错误

# fieldErrorConfirmPassword
source: Password does not match
th: รหัสผ่านไม่ตรงกัน
vi: Mật khẩu không hợp lệ
zh: 密码不符合

# fieldErrorInvalidAccount
source: The account number is {min}~{max} lowercase English/Numbers
th: เลขที่บัญชีคือ {min} ~ {max} ตัวพิมพ์เล็กภาษาอังกฤษ / ตัวเลข
vi: Số tài khoản là {min} ~ {max} tiếng Anh viết thường / số
zh: 帐号为{min}~{max}个小写英文/数字

# fieldErrorInvalidCreditAmount
source: Amount entered incorrectly
th: จำนวนเงินที่ป้อนไม่ถูกต้อง
vi: Số tiền nhập không chính xác
zh: 金额输入错误

# fieldErrorInvalidCreditMax
source: The maximum amount is {num}
th: จำนวนเงินสูงสุดคือ {num}
vi: Số tiền tối đa là {num}
zh: 金额最大值为{num}

# fieldErrorInvalidCreditMin
source: The minimum amount is {num}
th: จำนวนเงินขั้นต่ำคือ {num}
vi: Số tiền tối thiểu là {num}
zh: 金额最小值为{num}

# fieldErrorInvalidDate
source: Please enter the correct date (format: New Year – Month – Day)
th: โปรดป้อนวันที่ที่ถูกต้อง (ในรูปแบบ: AD ปี - เดือน - วัน)
vi: Vui lòng nhập đúng ngày (định dạng: Tết - Tháng - Ngày)
zh: 请输入正确日期(格式为：西元年–月–日)

# fieldErrorInvalidDateRange
source: Wrong time range
th: ข้อผิดพลาดของช่วงเวลา
vi: Khoảng thời gian sai
zh: 时间范围错误

# fieldErrorInvalidEmail
source: Please enter the correct email address
th: โปรดป้อนที่อยู่อีเมลที่ถูกต้อง
vi: Vui lòng nhập địa chỉ email chính xác
zh: 请输入正确的电子邮箱

# fieldErrorInvalidFormat
source: Input format error
th: ข้อผิดพลาดรูปแบบการป้อนข้อมูล
vi: Lỗi định dạng đầu vào
zh: 输入格式错误

# fieldErrorInvalidInput
source: Contains illegal characters
th: มีอักขระที่ไม่ถูกต้อง
vi: Chứa các ký tự bất hợp pháp
zh: 含非法字符

# fieldErrorInvalidPassword
source: Password should be {min}~{max} characters
th: รหัสผ่านคือ {min} ~ {max} characters
vi: Mật khẩu dài {min} ~ {max} ký tự
zh: 密码为{min}~{max}个字

# fieldErrorInvalidPhone
source: Phone format error ({num} code)
th: ข้อผิดพลาดรูปแบบโทรศัพท์ ({num} code)
vi: Lỗi định dạng điện thoại (mã {num})
zh: 电话格式错误({num}碼)

# fieldErrorInvalidPhone2
source: Phone format error ({min}~{max} code)
th: ข้อผิดพลาดของรูปแบบโทรศัพท์ ({min} ~ {max} code)
vi: Lỗi định dạng điện thoại (mã {min} ~ {max})
zh: 电话格式错误({min}~{max}碼)

# fieldErrorInvalidPostCode
source: Incorrect postal code (5~8 codes)
th: รหัสไปรษณีย์ไม่ถูกต้อง (5 ~ 8 รหัส)
vi: Mã bưu chính không chính xác (5 ~ 8 mã)
zh: 邮递区号错误(5~8碼)

# fieldErrorInvalidVerify
source: Please enter verification code
th: โปรดป้อนรหัสยืนยัน
vi: vui lòng nhập mã xác nhận
zh: 请输入验证码

# fieldErrorInvalidWechat
source: Wechat format error
th: ข้อผิดพลาดรูปแบบ Wechat
vi: Lỗi định dạng wechat
zh: 微信号格式错误

# fieldErrorInvalidZalo
source: Zalo format error
th: ข้อผิดพลาดรูปแบบ Zalo
vi: Zalo lỗi định dạng
zh: Zalo格式错误

# fieldHintAmount
source: It is recommended that you deposit a special amount so that it can be matched quickly (for example: 105, 503, etc.)
th: ขอแนะนำให้คุณฝากเงินจำนวนพิเศษเพื่อให้เงินฝากเข้าบัญชีได้อย่างรวดเร็ว (เช่น 105, 503 เป็นต้น)
vi: Bạn nên gửi một số tiền đặc biệt để khoản tiền gửi có thể được khớp nhanh chóng (ví dụ: 105, 503, v.v.)
zh: 建議您存入特殊金額，以便存款快速匹配到帳(例如：105, 503等)

# fieldHintBirthday
source: Fill in the birthday date to ensure that you are of legal age
th: กรอกวันเกิดให้แน่ใจว่าคุณมีอายุตามกฎหมาย
vi: Điền vào ngày sinh nhật để đảm bảo rằng bạn đủ tuổi hợp pháp
zh: 填写生日日期，确保您已符合法定年龄

# fieldHintDateFormat
source: The format is: 0000–00–00
th: รูปแบบคือ: 0000–00–00
vi: Định dạng là: 0000–00–00
zh: 格式为：0000–00–00

# fieldHintDepositAmountRange
source: amount range: {num}~{num2}
th: ช่วงอินพุต: {num} ~ {num2}
vi: Phạm vi đầu vào: {num} ~ {num2}
zh: 输入范围:{num}~{num2}

# fieldHintDepositAmountStep
source: The amount is a multiple of {step}
th: จำนวนเงินเป็นผลคูณของ {step}
vi: Số tiền là bội số của {step}
zh: 金额为{step}的倍数

# fieldHintDepositBankAccount
source: please enter your bank account
th: กรุณากรอกหมายเลขบัญชีธนาคารของผู้ส่ง
vi: Vui lòng điền vào tài khoản ngân hàng của người thanh toán
zh: 请填写打款人的银行账号

# fieldHintDepositCode
source: please fill in the transaction code
th: กรุณากรอกรหัสธุรกรรม
vi: Vui lòng điền mã giao dịch
zh: 请填写交易码

# fieldHintDepositName
source: please enter the account owner's name
th: กรุณากรอกชื่อผู้ฝากของคุณ
vi: Vui lòng điền tên người thanh toán của bạn
zh: 请填写您的打款人姓名

# fieldHintInputAccount
source: please enter your account
th: โปรดป้อนหมายเลขบัญชี
vi: vui lòng nhập tài khoản của bạn
zh: 请输入帐号

# fieldHintInputConfirmedPassword
source: please enter confirm password
th: โปรดป้อนรหัสผ่านที่ยืนยันแล้ว
vi: Vui lòng nhập mật khẩu xác nhận
zh: 请输入确认密码

# fieldHintInputEmail
source: please enter your email
th: โปรดป้อนที่อยู่อีเมล
vi: Vui lòng nhập email
zh: 请输入电子邮箱

# fieldHintInputName
source: please enter user name
th: โปรดป้อนชื่อผู้ใช้
vi: Vui lòng nhập tên người dùng
zh: 请输入用户名

# fieldHintInputPassword
source: please enter password
th: โปรดป้อนรหัสผ่าน
vi: Xin vui lòng nhập mật khẩu
zh: 请输入密码

# fieldHintInputPasswordAgain
source: enter the password again
th: ป้อนรหัสผ่านอีกครั้ง
vi: Nhập lại mật khẩu
zh: 再次输入密码

# fieldHintInputPhone
source: please enter your phone number
th: โปรดป้อนหมายเลขโทรศัพท์
vi: Vui lòng nhập số điện thoại
zh: 请输入手机号

# fieldHintInputReferralCode
source: please enter the referral code
th: โปรดป้อนรหัสอ้างอิง
vi: Vui lòng nhập mã giới thiệu
zh: 请输入推荐码

# fieldHintMobileVerifyCode
source: please enter the phone verification code
th: โปรดป้อนรหัสยืนยันมือถือ
vi: Vui lòng nhập mã xác minh điện thoại
zh: 请输入手机验证码

# fieldHintPasswordNew
source: please enter a new password
th: ป้อนรหัสผ่านใหม่
vi: Nhập mật khẩu mới
zh: 输入新密码

# fieldHintPasswordNewConfirm
source: enter the new password again
th: ป้อนรหัสผ่านใหม่อีกครั้ง
vi: Nhập lại mật khẩu mới
zh: 再次输入新密码

# fieldHintPasswordOld
source: please enter your old password
th: ป้อนรหัสผ่านเก่า
vi: Nhập mật khẩu cũ
zh: 输入旧密码

# fieldHintPhone
source: Bind mobile phone number to protect account security
th: ผูกหมายเลขโทรศัพท์มือถือเพื่อป้องกันความปลอดภัยของบัญชี
vi: Liên kết số điện thoại di động để bảo vệ bảo mật tài khoản
zh: 绑定手机号码保护帐号安全

# fieldHintSearchGame
source: please enter a name
th: โปรดป้อนชื่อเกม
vi: Vui lòng nhập tên trò chơi
zh: 请输入游戏名称

# fieldHintVerifyCode
source: please enter verification code
th: โปรดป้อนรหัสยืนยัน
vi: vui lòng nhập mã xác nhận
zh: 请输入验证码

# fieldHintVerifyCodeFetch
source: Only one set of verification codes can be obtained within 24 hours
th: สามารถรับรหัสยืนยันได้เพียงชุดเดียวภายใน 24 ชั่วโมง
vi: Chỉ có thể nhận được một bộ mã xác minh trong vòng 24 giờ
zh: 24小时内只能获取一组验证码

# fieldOptionDateAll
source: All
th: ตลอดเวลา
vi: Mọi lúc
zh: 全部时间

# fieldOptionDateCustom
source: Custom
th: เวลาที่กำหนดเอง
vi: Thời gian tùy chỉnh
zh: 自订时间

# fieldOptionDateMonth
source: Within a month
th: ภายในหนึ่งเดือน
vi: Trong vòng một tháng
zh: 一个月内

# fieldOptionDateToday
source: Today
th: วันนี้
vi: Ngày nay
zh: 今天

# fieldOptionDateYesterday
source: Yesterday
th: เมื่อวาน
vi: hôm qua
zh: 昨天

# fieldOptionDepositTypeAtm
source: ATM Transfer
th: เงินฝาก ATM
vi: Nạp tiền ATM
zh: ATM充值

# fieldOptionDepositTypeTransfer
source: Transfer
th: โอนและเติมเงิน
vi: Chuyển quĩ
zh: 转帐充值

# fieldOptionPlatformAll
source: All platforms
th: ทุกแพลตฟอร์ม
vi: Tất cả các nền tảng
zh: 全部平台

# fieldOptionPromoNone
source: Give up the offer
th: ละทิ้งข้อเสนอของแอปพลิเคชัน
vi: Từ bỏ đề nghị
zh: 放弃申请优惠

# fieldOptionStatus1
source: success
th: ความสำเร็จ
vi: sự thành công
zh: 成功

# fieldOptionStatus2
source: failure
th: ล้มเหลว
vi: sự thất bại
zh: 失败

# fieldOptionStatus3
source: processing
th: กำลังประมวลผล
vi: Chế biến
zh: 处理中

# fieldOptionStatus4
source: new
th: ธุรกรรมใหม่
vi: Giao dịch mới
zh: 新交易

# fieldOptionStatusAll
source: All state
th: ทั้งหมด
vi: Tất cả
zh: 全部

# fieldOptionTitleBetDate
source: Bet time
th: เวลาเดิมพัน
vi: Thời gian đặt cược
zh: 投注时间

# fieldOptionTitleDepositBank
source: Payer bank
th: ธนาคารของผู้ชำระเงิน
vi: Ngân hàng thanh toán
zh: 打款人银行

# fieldOptionTitleDepositType
source: Deposit Method
th: วิธีการเติมเงิน
vi: Phương thức nạp tiền
zh: 充值方式

# fieldOptionTitlePaymentBank
source: Payment bank
th: ธนาคารสำหรับชำระเงิน
vi: Ngân hàng thanh toán
zh: 支付银行

# fieldOptionTitlePlatform
source: Platform
th: แพลตฟอร์มเกม
vi: nền tảng chơi game
zh: 游戏平台

# fieldOptionTitlePromo
source: Select Promo
th: เลือกข้อเสนอ
vi: Chọn ưu đãi
zh: 选择优惠

# fieldOptionTitleShow
source: Show
th: ดิสเพลย์
vi: trưng bày
zh: 显示

# fieldOptionTitleShowItem
source: Items
th: รายการ
vi: mục
zh: 项

# fieldOptionTitleTransferDate
source: Transfer time
th: เวลาโอน
vi: Thời gian chuyển giao
zh: 转帐时间

# fieldOptionType1
source: Deposit
th: เติมเงิน
vi: Nạp điện
zh: 充值

# fieldOptionType2
source: Withdraw
th: ถอน
vi: rút lui
zh: 提现

# fieldOptionType3
source: Bonus
th: โบนัส
vi: cổ tức
zh: 红利

# fieldOptionTypeAll
source: All types
th: ทั้งหมด
vi: Tất cả
zh: 全部

# fieldTitleAccount
source: Account
th: บัญชี
vi: số tài khoản
zh: 帐号

# fieldTitleAccountHolder
source: Account holder
th: เจ้าของบัญชี
vi: Chủ tài khoản
zh: 账户持有人

# fieldTitleAccountName
source: Account name
th: ชื่อบัญชี
vi: Tên tài khoản
zh: 帐户姓名

# fieldTitleBank
source: Bank
th: ธนาคาร
vi: Ngân hàng
zh: 所属银行
