Repository: 54maxwu/flutter-eg990-mobile
Catalog: lib/l10n/intl_*.arb
Languages: th, vi, zh

# fieldTitleBankAccount
source: Account (card) number
th: หมายเลขบัญชี (บัตร)
vi: Số thẻ ngân hàng
zh: 银行卡号

# fieldTitleBankArea
source: Bank Location
th: พื้นที่
vi: Khu vực
zh: 所在地区

# fieldTitleBankBranch
source: Bank Branch
th: สาขาธนาคาร
vi: Chi nhánh ngân hàng
zh: 银行支行

# fieldTitleBankName
source: Bank name
th: ชื่อธนาคาร
vi: Tên ngân hàng
zh: 银行名称

# fieldTitleBankProvince
source: Bank Province
th: สาขาที่เปิดบัญชี
vi: Mở tài khoản
zh: 开户网点

# fieldTitleBirthday
source: Birthday
th: วันเกิด
vi: Sinh nhật
zh: 生日

# fieldTitleConfirm
source: Confirm Password
th: ยืนยันรหัสผ่าน
vi: Xác nhận mật khẩu
zh: 确认密码

# fieldTitleCreditAmount
source: Amount
th: จำนวนเงิน
vi: Số tiền
zh: 金额

# fieldTitleDateEnd
source: End Time
th: เวลาสิ้นสุด
vi: Thời gian kết thúc
zh: 結束时间

# fieldTitleDateStart
source: Starting time
th: เวลาเริ่มต้น
vi: Thời gian bắt đầu
zh: 開始时间

# fieldTitleDepositAmount
source: Amount
th: จำนวนเงินฝาก
vi: Số tiền đặt cọc
zh: 存款金额

# fieldTitleDepositBankAccount
source: Account
th: บัญชีธนาคารของผู้ชำระเงิน
vi: Tài khoản ngân hàng của người thanh toán
zh: 打款人银行账号

# fieldTitleDepositCode
source: Transaction code
th: รหัสธุรกรรม
vi: Mã giao dịch
zh: 交易码

# fieldTitleDepositName
source: Name
th: ชื่อผู้ชำระเงิน
vi: Tên người thanh toán
zh: 打款人姓名

# fieldTitleEmail
source: E-Mail
th: อีเมล
zh: 电子信箱

# fieldTitleFacebook
source: Facebook
th: เฟสบุ๊ค

# fieldTitleLine
source: Line
th: เส้น
vi: Hàng

# fieldTitleMemberAccount
source: Username
th: ชื่อผู้ใช้
vi: tên tài khoản
zh: 用户名

# fieldTitleMemberName
source: Real name
th: ชื่อจริง
vi: tên thật
zh: 真实姓名

# fieldTitleMobileVerifyCode
source: Mobile verification code
th: Mobile Verify Code
vi: Mã xác minh điện thoại
zh: 手机验证码

# fieldTitleNote
source: Remarks
th: หมายเหตุ
vi: Nhận xét
zh: 备注

# fieldTitlePassword
source: Password
th: รหัสผ่าน
vi: mật khẩu
zh: 密码

# fieldTitlePasswordNew
source: New Password
th: รหัสผ่านใหม่
vi: mật khẩu mới
zh: 新密码

# fieldTitlePasswordNewConfirm
source: Confirm New Password
th: การยืนยันรหัสผ่านใหม่
vi: xác nhận khóa mới
zh: 新密码确认

# fieldTitlePasswordOld
source: Old Password
th: รหัสผ่านเก่า
vi: Mật khẩu cũ
zh: 旧密码

# fieldTitlePhone
source: Mobile
th: หมายเลขโทรศัพท์มือถือ
vi: số điện thoại
zh: 手机号

# fieldTitleReferralCode
source: Referral code
th: รหัสคำแนะนำ
vi: Mã giới thiệu
zh: 推荐码

# fieldTitleRemark
source: Remarks
th: หมายเหตุ
vi: Nhận xét
zh: 备注

# fieldTitleVerifyCode
source: Verification code
th: ยืนยันรหัส
vi: Mã xác nhận
zh: 验证码

# fieldTitleWechat
source: Wechat ID
th: Wechat
vi: Chúng tôi trò chuyện số
zh: 微信号

# fieldTitleWithdrawAmount
source: Withdrawal Amount
th: จำนวนเงินที่ถอน
vi: Số tiền rút
zh: 提款金额

# fieldTitleWithdrawPassword
source: Withdrawal Password
th: ถอนรหัสผ่าน
vi: Mật khẩu rút tiền
zh: 提现密码

# gameToolBtnBackHome
source: Back to Homepage
th: กลับไปที่บ้าน
vi: quay lại trang chủ
zh: 回首页

# gameToolBtnLockRotate
source: Lock screen direction
th: ล็อกหน้าจอหมุน
vi: Khóa màn hình xoay
zh: 锁定旋屏

# gameToolBtnRotate
source: Rotate the screen
th: หมุนหน้าจอ
vi: Xoay màn hình
zh: 旋转屏幕

# gameToolHintRestore
source: Double click to restore from hide
th: ดับเบิลคลิกเพื่อคืนค่าการแสดงผล
vi: Nhấp đúp để khôi phục màn hình
zh: 双击可恢复显示

# gameToolHintUsage
source: Click to show, long press to hide ↗
th: คลิกเพื่อแสดงกดแบบยาวเพื่อซ่อน↗
vi: Nhấp để hiển thị, nhấn và giữ để ẩn ↗
zh: 单击显示，长按隐藏 ↗

# hintActionLogin
source: Please login first
th: กรุณาเข้าสู่ระบบก่อน
vi: Vui lòng đăng nhập trước
zh: 请先登入

# hintAddBankcard
source: Add a bank card
th: เพิ่ม Bankcard
vi: Thêm thẻ ngân hàng
zh: 添加银行卡

# hintAddBankcardDesc
source: Please bind a bank card to receive payment
th: โปรดผูกบัตรธนาคารเพื่อรับเงิน
vi: Vui lòng liên kết thẻ ngân hàng để nhận thanh toán
zh: 请先绑定一张银行卡，用于收款

# hintAttentionNotice
source: Notices
th: หมายเหตุ
vi: Các biện pháp phòng ngừa
zh: 注意事项

# hintClickToLoginRegister
source: Click to log in/register
th: คลิกเพื่อเข้าสู่ระบบ / ลงทะเบียน
vi: Bấm để đăng nhập / đăng ký
zh: 点击登录/注册

# hintCreditRemain
source: Total balance
th: ยอดคงเหลือทั้งหมด
vi: Tổng số dư
zh: 总余额

# hintFreeUsage
source: Free to use
th: ใช้งานฟรี
vi: Sử dụng miễn phí
zh: 免费使用

# hintHello
source: Hello!
th: สวัสดี!
vi: Xin chào!
zh: 您好！

# hintHelloLogin
source: Hello! Please log in as a member
th: สวัสดีกรุณาเข้าสู่ระบบในฐานะสมาชิก
vi: Xin chào! Hãy đăng nhập với tư cách thành viên
zh: 您好！ 请登入会员

# hintHelloLoginRegister
source: Hello! Please login/register first
th: สวัสดีกรุณาเข้าสู่ระบบ / ลงทะเบียนก่อน
vi: Xin chào! Vui lòng đăng nhập / đăng ký trước
zh: 您好! 请先登入/注册

# hintMaintenance
source: Under Maintenance
th: การบำรุงรักษา
vi: Đang bảo trì
zh: 维护中

# hintNoHistoryData
source: No information found
th: ไม่ตรวจสอบข้อมูล
vi: Không tìm thấy thông tin
zh: 查无资料

# hintNoMessages
source: There is currently no information on the site
th: ขณะนี้ไม่มีข้อความใด ๆ บนไซต์
vi: Hiện tại không có thông tin trên trang web
zh: 目前没有站内信息

# hintRefreshCreditAfterTransfer
source: If the platform amount has not changed after the transfer is successful, please select the platform to refresh the amount again or contact customer service
th: หากจำนวนแพลตฟอร์มไม่เปลี่ยนแปลงหลังจากการโอนสำเร็จโปรดเลือกแพลตฟอร์มเพื่อรีเฟรชจำนวนเงินอีกครั้งหรือติดต่อฝ่ายบริการลูกค้า
vi: Nếu số tiền nền tảng không thay đổi sau khi chuyển thành công, vui lòng chọn nền tảng để làm mới số tiền một lần nữa hoặc liên hệ với dịch vụ khách hàng
zh: 转帐成功後若平台金额未改变，请再次选择平台刷新金额或联系客服

# hintSelect
source: Select
th: โปรดเลือก
vi: xin vui lòng chọn
zh: 请选择

# hintSelectAmount
source: Please select the amount
th: โปรดเลือกจำนวนเงิน
vi: Vui lòng chọn số lượng
zh: 请选择金额

# hintSelectPlatform
source: Please choose a platform
th: โปรดเลือกแพลตฟอร์ม
vi: Vui lòng chọn một nền tảng
zh: 请选择平台

# hintServiceIcon
source: If you have any questions, please click this icon!
th: หากคุณมีคำถามใด ๆ โปรดคลิกที่ไอคอนนี้!
vi: Nếu bạn có bất kỳ câu hỏi nào, vui lòng nhấp vào biểu tượng này!
zh: 如有任何疑问，请单击此图标!

# hintTips
source: Tips
th: เคล็ดลับที่อบอุ่น
vi: Lời khuyên
zh: 温馨提示

# hintWalletRemain
source: Wallet balance
th: ยอดคงเหลือใน Wallet
vi: Số dư trên ví
zh: 钱包余额

# hintWelcome
source: Welcome
th: ยินดีต้อนรับ
vi: chào mừng
zh: 欢迎光临

# hintWelcomeMember
source: Hello {name}!
th: สวัสดี {name}!
vi: Xin chào {name}!
zh: {name}您好！

# msgActionCheckTerms
source: Please read and tick to agree to the betting rules
th: โปรดอ่านและทำเครื่องหมายเพื่อยอมรับกฎการเดิมพัน
vi: Vui lòng đọc và đánh dấu để đồng ý với các quy tắc cá cược
zh: 请阅读并勾选同意投注規则

# msgAutoLoginError
source: Data error, please log in manually
th: ข้อมูลผิดพลาดโปรดเข้าสู่ระบบด้วยตนเอง
vi: Lỗi dữ liệu, vui lòng đăng nhập thủ công
zh: 数据错误，请手动登入

# msgBalanceToMainPartFailed
source: Some platforms transfer failed
th: บางส่วนของการถ่ายโอนแพลตฟอร์มล้มเหลว
vi: Một số nền tảng chuyển không thành công
zh: 部分平台转帐失败

# msgCopyToClipboard
source: Copied to clipboard
th: คัดลอกไปยังคลิปบอร์ด
vi: Sao chép vào clipboard
zh: 已复制到剪贴板

# msgCopyToClipboardError
source: Copy failed
th: คัดลอกล้มเหลว
vi: Sao chép không thành công
zh: 复制失败

# msgFailed
source: The operation failed, please try again later
th: การดำเนินการล้มเหลวโปรดลองอีกครั้งในภายหลัง
vi: Thao tác không thành công, vui lòng thử lại sau
zh: 操作失败，请稍候再重试

# msgFormError
source: Data error, please select again
th: ข้อมูลผิดพลาดโปรดเลือกอีกครั้ง
vi: Lỗi dữ liệu, vui lòng chọn lại
zh: 数据错误，请重新选择

# msgFormNotFilled
source: Please confirm the field information and complete it
th: โปรดยืนยันข้อมูลในฟิลด์และกรอกให้ครบถ้วน
vi: Vui lòng xác nhận thông tin trường và hoàn thành
zh: 请确认栏位信息并填写完整

# msgLoadingGame
source: Loading game, please wait...
th: กำลังโหลดเกมโปรดรอสักครู่ ...
vi: Đang tải trò chơi, vui lòng đợi ...
zh: 加载游戏中，请稍候…

# msgMobileVerifySent
source: Verification code sent
th: ส่งรหัสยืนยันแล้ว
vi: mã xác minh đã gửi
zh: 已发送验证码

# msgNetworkChanged
source: Detected network status changed. Do you want to refresh the page?
th: ตรวจพบการเปลี่ยนแปลงสถานะเครือข่ายคุณต้องการรีเฟรชหน้านี้หรือไม่
vi: Đã phát hiện thấy thay đổi trạng thái mạng. Bạn có muốn làm mới trang không?
zh: 偵測到網路狀態變更，是否要刷新頁面?

# msgNetworkError
source: Please check the network status
th: โปรดตรวจสอบสถานะเครือข่าย
vi: Vui lòng kiểm tra trạng thái mạng
zh: 请检查网络状态

# msgNetworkLocationNoService
source: This service is not available in your network area
th: ไม่สามารถใช้บริการนี้ในพื้นที่เครือข่ายของคุณได้
vi: Dịch vụ này không khả dụng trong khu vực mạng của bạn
zh: 您所在的网络区域无法使用此服务

# msgNetworkUsingCellular
source: You are using a mobile network, and network charges may be incurred according to your usage rate
th: คุณกำลังใช้เครือข่ายมือถือและค่าบริการเครือข่ายอาจเกิดขึ้นตามอัตราการใช้งานของคุณ
vi: Bạn đang sử dụng mạng di động và phí mạng có thể phát sinh theo mức sử dụng của bạn
zh: 您正在使用移动网络，依您的使用费率可能产生网络费用

# msgNoEvent
source: There is currently no activity
th: ขณะนี้ไม่มีเหตุการณ์
vi: Hiện tại không có hoạt động nào
zh: 当前没有活动

# msgNoStoragePermission
source: Please enable "Save" permission
th: โปรดเปิด“ันทึก”สิทธิ์
vi: Vui lòng bật quyền "Lưu"
zh: 请开启“保存”权限

# msgNotEnoughCredit
source: Insufficient balance
th: ยอดเงินไม่เพียงพอ
vi: Thiếu cân bằng
zh: 余额不足

# msgNoWalletBindUrl
source: Unable to get {wallet} wallet binding URL
th: ไม่สามารถรับ URL ผูกกระเป๋าเงิน {wallet}
vi: Không thể nhận URL liên kết ví {wallet}
zh: 无法取得{wallet}钱包綁定網址

# msgPleaseBindBankcard
source: Please bind the bank card first!
th: กรุณาผูกบัตรธนาคารก่อน!
vi: Vui lòng ràng buộc thẻ ngân hàng trước!
zh: 请先绑定银行卡！

# msgPleaseWait
source: Please wait…
th: โปรดรอสักครู่ ...
vi: Vui lòng đợi…
zh: 请稍候…

# msgProcessing
source: Processing request, please wait...
th: กำลังดำเนินการตามคำขอโปรดรอสักครู่ ...
vi: Đang xử lý yêu cầu, vui lòng đợi ...
zh: 处理请求中，请稍候…

# msgSuccess
source: Successful operation
th: ดำเนินการสำเร็จ
vi: Hoạt động thành công
zh: 操作成功

# msgTaskCanceled
source: {Task} cancelled
th: {task} ถูกยกเลิก
vi: Đã hủy {Task}
zh: 已取消{task}

# msgTaskSuccess
source: {task} succeeded
th: {task} Success
vi: {task} đã thành công
zh: {task}成功

# msgTransferFromTo
source: {from} to {to}
th: {from} ถึง {to}
zh: {from} 到 {to}

# msgUrlLaunchError
source: Unable to open web link: {url}
th: ไม่สามารถเปิดลิงก์ของเว็บ: {url}
vi: Không thể mở liên kết web: {url}
zh: 無法開啟網頁連結：{url}

# msgUrlNavNotSupported
source: Unable to jump to the destination URL
th: ไม่สามารถข้ามไปยัง URL ปลายทางได้
vi: Không thể chuyển đến URL đích
zh: 无法跳转至目的地网址

# msgUserLogout
source: {name}, please log in again
th: {name} โปรดเข้าสู่ระบบอีกครั้ง
vi: {name}, vui lòng đăng nhập lại
zh: {name}，请重新登入

# msgVerifySuccess
source: Verified successfully
th: การยืนยันสำเร็จ
vi: Đã xác minh thành công
zh: 验证成功

# msgWaitLogin
source: Signing in, please wait...
th: เข้าสู่ระบบโปรดรอ ...
vi: Đang đăng nhập, vui lòng đợi ...
zh: 登入中，请稍候...

# msgWaitProcessComplete
source: Please do not log out while processing the request
th: ห้ามออกขณะดำเนินการตามคำขอ
vi: Vui lòng không đăng xuất trong khi xử lý yêu cầu
zh: 处理请求中，请勿退出

# msgWelcomeUser
source: Welcome, {name}
th: ยินดีต้อนรับ {name}
vi: Chào mừng, {name}
zh: 欢迎，{name}

# msgWorkInProgress
source: Features will be online soon!
th: ฟีเจอร์จะเปิดตัวเร็ว ๆ นี้!
vi: Các tính năng sẽ sớm được trực tuyến!
zh: 功能即将上线!

# noticeTabGeneral
source: General
th: ข้อความทั่วไป
vi: Thông tin chung
zh: 一般讯息

# noticeTabMaintenance
source: Maintenance
th: ประกาศเกี่ยวกับการบำรุงรักษา
vi: Thông báo bảo trì
zh: 维护通知

# pageBtnChangePassword
source: Change Password
th: เปลี่ยนรหัสผ่าน
vi: thay đổi mật khẩu
zh: 更改密码

# pageBtnContactCs
source: Contact Customer Service
th: ติดต่อฝ่ายบริการลูกค้า
vi: Dịch vụ khách hàng
zh: 联系客服

# pageBtnHelp
source: Tutorials
th: บทช่วยสอน
vi: Hướng dẫn
zh: 教程

# pageBtnLogin
source: Sign in
th: เข้าสู่ระบบ
vi: Đăng nhập
zh: 登入

# pageBtnLogout
source: Sign out
th: ออกจากระบบ
vi: Đăng xuất
zh: 登出

# pageBtnMenu
source: Menu
th: เมนู
vi: Thực đơn
zh: 选单

# pageBtnNotify
source: Notice
th: แจ้งเตือน
vi: Để ý
zh: 通知

# pageBtnOnlineCs
source: Online Service
th: บริการลูกค้าออนไลน์
vi: dịch vụ trực tuyến
zh: 在线客服

# pageBtnRegister
source: Register
th: ลงทะเบียน
vi: đã đăng ký
zh: 注册

# pageBtnSetting
source: Settings
th: การตั้งค่า
vi: Thiết lập
zh: 设置

# pageHintExchangeRecord
source: prize redemption, bonus record
th: การแลกเปลี่ยนรางวัลบันทึกโบนัส
vi: Đổi giải thưởng, kỷ lục tiền thưởng
zh: 奖品兑换、红利记录

# pageHintHelpCenter
source: If you have any questions about deposits, withdrawals and betting, please see here
th: หากคุณมีคำถามเกี่ยวกับการฝากและถอนการเดิมพันโปรดดูที่นี่
vi: Mọi thắc mắc về nạp tiền, rút tiền và cá cược, vui lòng xem tại đây
zh: 存取款、投注有疑问，看这里

# pageHintInvite
source: Invite friends to share tens of millions of cash
th: ชวนเพื่อนมาแชร์เงินสดหมื่นล้าน
vi: Mời bạn bè chia sẻ hàng chục triệu tiền mặt
zh: 邀请好友瓜分千万现金

# pageHintJoinUs
source: Joint venture plan
th: แผนการเข้าร่วม
vi: Kế hoạch liên doanh
zh: 合营计划

# pageHintWebsite
source: Open Website
th: เปิดหน้าเว็บไซต์
vi: Mở trang web
zh: 开启网站页面

# pageTitleAboutUs
source: About us
th: เกี่ยวกับเรา
vi: về chúng tôi
zh: 关于我们

# pageTitleCenter
source: Center
th: ศูนย์ส่วนบุคคล
vi: Trung tâm cá nhân
zh: 个人中心

# pageTitleDeposit
source: Deposit
th: เติมเงิน
vi: Nạp điện
zh: 充值

# pageTitleExchangeRecord
source: Prize Record
th: บันทึกการแลกรางวัล
vi: Kỷ lục đổi thưởng
zh: 兑奖纪录

# pageTitleHelpCenter
source: Help Center
th: ศูนย์ช่วยเหลือ
vi: Trung tâm trợ giúp
zh: 帮助中心

# pageTitleHome
source: Home
th: หน้าแรก
vi: Trang Chủ
zh: 首页

# pageTitleInvite
source: Invite friends
th: เชิญเพื่อน
vi: mời bạn bè
zh: 邀请好友

# pageTitleJoinUs
source: Join us
th: เข้าร่วมกับเรา
vi: tham gia với chúng tôi
zh: 加入我们

# pageTitleLogin
source: Sign in
th: เข้าสู่ระบบ
vi: Đăng nhập
zh: 登入

# pageTitleMember
source: MY
th: ของฉัน
vi: của tôi
zh: 我的

# pageTitleMemberBalance
source: Balance
th: ยอดคงเหลือของแพลตฟอร์ม
vi: Số dư nền tảng
zh: 平台馀额

# pageTitleMemberBets
source: Betting Record
th: ประวัติการเดิมพัน
vi: kỷ lục cá cược
zh: 投注记录

# pageTitleMemberCard
source: Bank card
th: บัตรธนาคาร
vi: Thẻ ngân hàng
zh: 银行卡

# pageTitleMemberCenter
source: Account Center
th: ศูนย์บัญชี
vi: Trung tâm tài khoản
zh: 帐户中心

# pageTitleMemberDeals
source: Transaction Record
th: ประวัติการทำธุรกรรม
vi: Ghi lại giao dịch
zh: 交易记录

# pageTitleMemberFlow
source: Flow record
th: โฟลว์เรคคอร์ด
vi: Bản ghi luồng
zh: 流水记录

# pageTitleMemberLogin
source: Member Login
th: เข้าสู่ระบบสมาชิก
vi: Đăng nhập thành viên
zh: 会员登入

# pageTitleMemberMessage
source: Message
th: ข้อความของไซต์
vi: Trạm thư
zh: 站内信

# pageTitleMemberTransaction
source: Transfer Record
th: บันทึกการโอน
vi: Chuyển hồ sơ
zh: 转帐记录

# pageTitleMemberTransfer
source: Transfer
th: โอน
vi: chuyển khoản
zh: 转帐

# pageTitleMemberWallet
source: Wallet
th: โอนกระเป๋าเงินฟรี
vi: Ví không chuyển tiền
zh: 免转钱包

# pageTitleMemberWithdraw
source: Withdraw
th: ถอน
vi: rút lui
zh: 提现

# pageTitleNotice
source: Announcement
th: ประกาศ
vi: sự thông báo
zh: 公告

# pageTitlePromo
source: Promo
th: โปรโมชั่น
vi: Giảm giá
zh: 优惠

# pageTitleRegister
source: Register
th: ลงทะเบียน
vi: đã đăng ký
zh: 注册

# pageTitleRegisterFree
source: Sign up for free
th: ลงทะเบียนฟรี
vi: Đăng kí miễn phí
zh: 免费注册

# pageTitleRegisterMember
source: Register as member
th: สมาชิกที่ลงทะเบียน
vi: thành viên đã đăng ký
zh: 注册会员

# pageTitleService
source: Customer Service
th: ฝ่ายบริการลูกค้า
vi: Dịch vụ khách hàng
zh: 客服

# pageTitleSponsor
source: Sponsor
th: ผู้สนับสนุน
vi: nhà tài trợ
zh: 赞助

# pageTitleStore
source: Yabo Mall
th: ห้างสรรพสินค้ายาโบ
zh: 亚博商城

# pageTitleVip
source: VIP
th: วีไอพี
vi: CAO CẤP

# pageTitleVipAbout
source: VIP Privileges
th: สิทธิพิเศษระดับ VIP
vi: Đặc quyền VIP
zh: VIP特权

# promoDetailApply
source: How to apply
th: วิธีการสมัคร
vi: Làm thế nào để nộp
zh: 申请方式

# promoDetailBtn
source: >>Promo Detail
th: >> ข้อมูลโปรโมชั่น
vi: >> Thông tin ưu đãi
zh: >>优惠信息

# promoDetailContent
source: Activities
th: เนื้อหากิจกรรม
vi: Hoạt động
zh: 活动内容

# promoDetailPlatform
source: Applicable platform
th: แพลตฟอร์มที่ใช้งานได้
vi: Nền tảng áp dụng
zh: 适用平台

# promoDetailRules
source: Activity Details
th: กฎของกิจกรรม
vi: Chi tiết hoạt động
zh: 活动细则

# promoNoInfo
source: No promo information
th: ไม่ตรวจสอบข้อมูลส่วนลด
vi: Kiểm tra không có thông tin ưu đãi
zh: 查无优惠信息

# promoNotFound
source: No promo
th: ตรวจสอบว่าไม่มีส่วนลด
vi: Kiểm tra không giảm giá
zh: 查无优惠

# rollbackIndexDeposit
source: Deposit
th: เงินฝาก
vi: tiền gửi
zh: 存款

# rollbackIndexPromo
source: Promo
th: โปรโมชัน
vi: Giảm giá
zh: 优惠

# rollbackIndexRollback
source: Rollback
th: คืนน้ำ
vi: Rút lui
zh: 退水

# serviceDescCustomerService
source: 24 hours service
th: บริการตลอด 24 ชั่วโมงไม่มีสะดุด
vi: 24 giờ dịch vụ không bị gián đoạn
zh: 24小时服务不间断

# serviceRouteHint
source: Need help or contact us
th: ต้องการความช่วยเหลือหรือติดต่อเรา
vi: Cần giúp đỡ hoặc liên hệ với chúng tôi
zh: 需要帮助或联系我们

# serviceTitleAppQr
source: APP QRCode
th: APP Scan Code
vi: Mã quét APP
zh: APP 扫码

# serviceTitleCustomerService
source: Online customer service
th: บริการลูกค้าออนไลน์
vi: Dịch vụ khách hàng trực tuyến
zh: 在线客服服务

# serviceTitleZaloQr
source: Zalo QRCode
th: Zalo Scan Code
vi: Mã quét Zalo
zh: Zalo 扫码

# tableHeaderAmount
source: Amount
th: จำนวนเงิน
vi: Số tiền
zh: 金额

# tableHeaderBetAmount
source: Bet amount
th: จำนวนเงินเดิมพัน
vi: Số tiền đặt cược
zh: 投注额

# tableHeaderBetsCurrent
source: Current bet
th: การเดิมพันปัจจุบัน
vi: Đặt cược hiện tại
zh: 当前注额

# tableHeaderBetsNeed
source: Need
th: ต้องเหลือจำนวนเงินเดิมพัน
vi: Số tiền còn lại được yêu cầu
zh: 注额须求剩馀

# tableHeaderBetsRequire
source: Required Bets
th: จำนวนเงินเดิมพันที่ต้องการ
vi: Yêu cầu đặt cược
zh: 注额须求

# tableHeaderBonus
source: Payout amount
th: จำนวนเงินที่จ่าย
vi: Số tiền thanh toán
zh: 派彩金额

# tableHeaderDate
source: Date
th: วันที่
vi: ngày
zh: 日期

# tableHeaderDesc
source: Description
th: คำอธิบาย
vi: Sự miêu tả
zh: 说明

# tableHeaderDetail
source: Detail
th: รายละเอียด
vi: Chi tiết
zh: 明细

# tableHeaderGame
source: Game
th: ชื่อเกม
vi: tên của trò chơi
zh: 游戏名称

# tableHeaderId
source: Bet No.
th: หมายเลขหมายเหตุ
vi: Số đặt cược
zh: 注单号

# tableHeaderMultiple
source: Multiply
th: หลายรายการ
vi: bội số
zh: 倍数

# tableHeaderObject
source: Object
th: โครงการ
vi: dự án
zh: 项目

# tableHeaderPlatform
source: Platform
th: แพลตฟอร์ม
vi: nền tảng
zh: 平台

# tableHeaderPromo
source: Promo
th: โปรโมชั่นเงินสด
vi: Giảm giá tiền mặt
zh: 现金优惠

# tableHeaderSerial
source: No.
th: หมายเลขซีเรียล
vi: Số sê-ri
zh: 序号

# tableHeaderSheetNo
source: No.
th: หมายเลขเดียว
vi: Đơn số
zh: 单号

# tableHeaderStatus
source: Status
th: สถานะการสั่งซื้อ
vi: Tình trạng đặt hàng
zh: 订单状态

# tableHeaderSum
source: Sum
th: ทั้งหมด
vi: toàn bộ
zh: 合计

# tableHeaderTime
source: Time
th: เวลา
vi: thời gian
zh: 时间

# tableHeaderTimeRange
source: Time interval
th: ช่วงเวลา
vi: Khoảng thời gian
zh: 时间区间

# tableHeaderTotal
source: Total
th: ทั้งหมด
vi: toàn bộ
zh: 总计

# tableHeaderTransferCode
source: Transaction code
th: รหัสธุรกรรม
vi: Mã giao dịch
zh: 交易码

# tableHeaderType
source: Type
th: หมวดหมู่
vi: thể loại
zh: 类别

# tableHeaderValidBet
source: Valid bet
th: เดิมพันที่ถูกต้อง
vi: Cược hợp lệ
zh: 有效投注

# textCategoryAbout
source: About us
th: เกี่ยวกับเรา
vi: về chúng tôi
zh: 关于我们

# textCategoryAll
source: All
th: ทั้งหมด
vi: Tất cả
zh: 全部

# textCategoryCard
source: Card
th: หมากรุก
vi: Cờ vua
zh: 棋牌

# textCategoryCardFull
source: Card Games
th: ไพ่หมากรุกยอดนิยม
vi: Cờ vua phổ biến
zh: 热门棋牌

# textCategoryCasino
source: Real person
th: บุคคลจริง
vi: Người thực
zh: 真人

# textCategoryCasinoFull
source: Live entertainment
th: คาสิโนสด
vi: Giải trí trực tiếp
zh: 真人娱乐

# textCategoryCockFighting
source: Cockfighting
th: ชนไก่
vi: chọi gà
zh: 斗鸡

# textCategoryEsport
source: E-Sport
th: Esports
vi: Chơi game
zh: 电竞

# textCategoryEsportFull
source: E-Sport Games
th: กีฬาอีสปอร์ต
vi: Thể thao điện tử
zh: 电竞体育

# textCategoryFavorite
source: Favorite
th: รายการโปรดของฉัน
vi: yêu thích của tôi
zh: 我的最爱

# textCategoryFish
source: Fishing
th: ตกปลา
vi: Đánh bắt cá
zh: 捕鱼

# textCategoryFishFull
source: Fishing Games
th: วิดีโอเกมตกปลา
vi: Trò chơi điện tử câu cá
zh: 捕鱼电玩

# textCategoryGames
source: Game
th: เกม
vi: trò chơi
zh: 游戏

# textCategoryGift
source: Gift
th: ของขวัญ
vi: quà tặng
zh: 礼物

# textCategoryLottery
source: Lottery
th: ลอตเตอรี
vi: Vé số
zh: 彩票

# textCategoryLotteryFull
source: Lottery Games
th: การพนันลอตเตอรี่
vi: Cá cược xổ số
zh: 彩票投注

# textCategoryMovie
source: Cinema
th: โรงภาพยนตร์
vi: Rạp chiếu phim
zh: 影城

# textCategoryMovieWeb
source: Movies
th: ดูหนัง
vi: xem phim
zh: 观看电影

# textCategoryMovieWebHint
source: Click me to watch the movie
th: คลิกฉันเพื่อชมภาพยนตร์
vi: Click vào tôi để xem phim
zh: 点我观看电影

# textCategoryOther
source: Other
th: อื่น ๆ
vi: khác
zh: 其他

# textCategoryRecommend
source: Webmaster Recommended
th: คำแนะนำสำหรับผู้ดูแลเว็บ
vi: Quản trị viên web được đề xuất
zh: 站长推荐

# textCategorySlot
source: Slot
th: อิเล็กทรอนิกส์
vi: điện tử
zh: 电子

# textCategorySlotFull
source: Slot Games
th: วิดีโอเกม
vi: Trò chơi điện tử
zh: 电子游戏

# textCategorySport
source: Sport
th: กีฬา
vi: giáo dục thể chất
zh: 体育

# textCategorySportFull
source: Sport Games
th: กีฬากีฬา
vi: Thi đấu thể thao
zh: 体育竞技

# textCategoryWeb
source: Website
th: เวอร์ชันเว็บ
vi: Phiên bản web
zh: 网页版

# textCategoryWebHint
source: Click me to open the {site} website
th: คลิกฉันเพื่อเปิดเวอร์ชันเว็บ {site}
vi: Nhấp vào tôi để mở phiên bản web {site}
zh: 点我开启{site}网页版

# textDefaultMarquee
source: Hello, dear member! If you have any questions about use, please use the online customer service system.
th: สวัสดีสมาชิกที่รัก! หากคุณมีคำถามใด ๆ เกี่ยวกับการใช้งานโปรดใช้ระบบบริการลูกค้าออนไลน์
vi: Xin chào, thành viên thân mến! Nếu bạn có bất kỳ câu hỏi nào về việc sử dụng, vui lòng sử dụng hệ thống dịch vụ khách hàng trực tuyến.
zh: 尊敬的会员您好！如果您有任何使用上的问题，请使用在线客服系统。

# textLanguage
source: Language
th: ภาษา
vi: Ngôn ngữ
zh: 語言

# textTotalCredit
source: Total: {value}
th: ทั้งหมด: {value}
vi: Tổng giá trị}
zh: 总计: {value}

# textTransferHint1
source: 1. Please exit the game or game betting interface before transferring money.
th: 1. กรุณาออกจากอินเทอร์เฟซการเดิมพันของเกมหรือเกมก่อนโอนเงิน
vi: 1. Vui lòng thoát trò chơi hoặc giao diện trò chơi cá cược trước khi chuyển.
zh: 1.转账前请退出游戏或游戏投注界面。

# textTransferHint2
source: 2. When not participating in the activity, the amount of the account transfer cannot be less than 1 yuan, and there is no handling fee for the account transfer.
th: 2. เมื่อคุณไม่ได้เข้าร่วมกิจกรรมจำนวนเงินในการรับส่งภายในอาคารต้องไม่ต่ำกว่า 1 หยวนและไม่มีค่าธรรมเนียมการจัดการสำหรับการโอนในร่ม
vi: 2. Khi không tham gia hoạt động, số tiền chuyển khoản không được ít hơn 1 tệ, và không tính phí xử lý chuyển khoản.
zh: 2.不参与活动时，户内转账金额不能少于1元，户内转账不收取任何手续费。

# textTransferHint3
source: 3. In case of slow internet speed, please wait patiently for a while instead of submitting it repeatedly.
th: 3. หากความเร็วอินเทอร์เน็ตช้าโปรดรอสักครู่และอย่าส่งซ้ำหลายครั้ง
vi: 3. Trong trường hợp tốc độ internet chậm, vui lòng kiên nhẫn chờ một lúc thay vì gửi nhiều lần.
zh: 3.如遇网速较慢时，请耐心等侯片刻，不要多次重复提交。

# textTransferHint4
source: 4. If the platform amount has not changed after the transfer is successful, please refresh the platform manually or contact customer service
th: 4. หากจำนวนแพลตฟอร์มไม่เปลี่ยนแปลงหลังจากการโอนสำเร็จโปรดรีเฟรชแพลตฟอร์มด้วยตนเองหรือติดต่อฝ่ายบริการลูกค้า
vi: 4. Nếu số tiền nền tảng không thay đổi sau khi chuyển thành công, vui lòng làm mới nền tảng theo cách thủ công hoặc liên hệ với dịch vụ khách hàng
zh: 4.转帐成功後若平台金额未改变，请手动刷新平台或联系客服

# textUpdateErrorUrl
source: Unable to get the download URL, please contact customer service!!
th: ไม่สามารถรับ URL ดาวน์โหลดได้โปรดติดต่อฝ่ายบริการลูกค้า !!
vi: Không thể lấy URL tải xuống, vui lòng liên hệ với dịch vụ khách hàng !!
zh: 无法取得下载网址，请联系客服!!
